In [1]:
import pandas as pd

# Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [17]:
s = pd.Series(["a", "b", "c"], index=[1, 2, 3], name="MySeries")

print(s)

1    a
2    b
3    c
Name: MySeries, dtype: object

# Q2: Change indexes to 11, 12, 13.

In [18]:
# Create a Series with indexes 1, 2, and 3 and data "a", "b", and "c"
s = pd.Series(["a", "b", "c"], index=[1, 2, 3], name="MySeries")

# Change the indexes to 11, 12, and 13
s.index = [11, 12, 13]

# Print the Series
print(s)

11    a
12    b
13    c
Name: MySeries, dtype: object

# Q3: Retrieve First and second elements.

In [19]:
s[0:3]

11    a
12    b
13    c
Name: MySeries, dtype: object

# Q4: Add duplicate elements, then remove the duplication.

In [25]:
# Create a Series with data "a", "b", and "c"
s = pd.Series(["a", "b", "c"], name="MySeries")

# Append duplicate elements
s = s.append(pd.Series(["b", "c", "d"]))

# Remove duplicates
s = s.drop_duplicates()

# Print the Series
print(s)

0    a
1    b
2    c
2    d
dtype: object

/var/folders/_d/2rnz5lxd0g73bjc7h0_4g7bw0000gn/T/ipykernel_31689/721867556.py:5: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s = s.append(pd.Series(["b", "c", "d"]))

# Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [30]:
# Create a dictionary with the data
data = {
    "ID": [1, 2, 3, 4],
    "Name": ["HA", "NO", "KH", "FA"],
    "GPA": [5.0, 4.0, 2.7, 3.9]
}

# Create the DataFrame
students_df = pd.DataFrame(data)

# Print the DataFrame
print(students_df)

   ID Name  GPA
0   1   HA  5.0
1   2   NO  4.0
2   3   KH  2.7
3   4   FA  3.9

# Q6: Read educ_figdp_1_Data.csv file and print the head.

In [47]:
edu = pd.read_csv("/Users/hamadbinmohammed/labs/PANDAS1/educ_figdp_1_Data.csv")

edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

# Q7: Give an example shows the difference between loc and slicing?
- Note:
    - loc use the index labels as references.
    - slice use the position as references.

In [51]:
edu[11:15]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e

In [53]:
edu.loc[93:99, ['TIME', 'GEO']]

    TIME       GEO
93  2009   Belgium
94  2010   Belgium
95  2011   Belgium
96  2000  Bulgaria
97  2001  Bulgaria
98  2002  Bulgaria
99  2003  Bulgaria